Autodesk.Revit.DB.ElementEpisodeRangeFilter.#ctor(Autodesk.Revit.DB.Document,System.Guid,System.Guid,Autodesk.Revit.DB.EpisodeUsage)
Constructs a new instance of a filter to match elements having the specified creation, modification,
or user-modification episode id in the specified range.
document:
The current document.
startEpisodeGuid:
The earliest element history to match. If null (all zeros), indicates earliest known episode.
endEpisodeGuid:
The latest element history to match. If null (all zeros), indicates latest known episode.
episodeUsage:
Restrict match to Creation, Modification, or User Modification episode id. Flags can be combined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.ElementEpisodeRangeFilter.#ctor(Autodesk.Revit.DB.Document,System.Guid,System.Guid,Autodesk.Revit.DB.EpisodeUsage,System.Boolean)
Constructs a new instance of a filter to match elements having the specified creation, modification,
or user-modification episode id in the specified range, with the option to invert the filter.
document:
The current document.
startEpisodeGuid:
The earliest element history to match. If null (all zeros), indicates earliest known episode.
endEpisodeGuid:
The latest element history to match. If null (all zeros), indicates latest known episode.
episodeUsage:
Restrict match to Creation, Modification, or User Modification episode id. Flags can be combined.
inverted:
True if the filter should match all elements whose versions are outside the specified range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.ElementEpisodeRangeFilter
A filter used to match elements altered within two specified episodes. The given episodes
are checked against one or more of the element's creation date, last user modification date,
or last modification date. If any match, then it is considered a overall match and included.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2023